content.org/2021.org
#+hugo_base_dir: /home/plovs/Projects/QWxleA.github.io
#+category: blog

** DONE Spaced repetition -- Learning with Emacs and Anki
   CLOSED: [2021-01-23 Sat 12:19]
   :PROPERTIES:
   :EXPORT_FILE_NAME: spaced-repetition-learning-with-emacs
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :description
   :EXPORT_HUGO_AUTO_SET_LASTMOD: t
   :END:

   Remembering is hard. Well, not for everybody, but for the average person, yes, it's hard. But, since leaving our caves, we have been busy creating tools. To remember things the best tools seems to be [[https://en.wikipedia.org/wiki/Spaced_repetition][Spaced repetition (Wikipedia)]]:

   > Spaced repetition is an evidence-based learning technique that is usually performed with flashcards. Newly introduced and more difficult flashcards are shown more frequently, while older and less difficult flashcards are shown less frequently in order to exploit the psychological spacing effect. The use of spaced repetition has been proven to increase rate of learning.

   The idea is to memorize 'hungul', the Korean alphabet. A popular tool seems to be [[https://ankiweb.net][anki]], open-source software that makes it easy to create and use 'decks' of cards. There are a whole bunch of decks for Korean, but I started out with [[https://ankiweb.net/shared/info/1831087318][this one]]. What I especially like is the possibility to use anki both on my phone ([[https://f-droid.org/en/packages/com.ichi2.anki/][AnkiDroid]]) and one my computer.

   After setting it up, I remembered [[https://irreal.org/blog/?p=8720][reading about org and anki]]. So, with a bit of googling I now have a simple setup to create my own cards. For Emacs, the second link under *Further reading* is excellent, for Anki, the 3rd.

   But first: let's memorize some more Korean characters, here's a small comic: ㅎㅂ ㄹㅆ ㄱㅎ ㄲㅎ (a man with a Hat, carrying a Bucket, sees a Ratelsnake, which hiSSes. the man with the Hat takes his Gun, and then the man with the Hat pulls the trigger to Kill the snake)

*** Further reading
    1. [[https://irreal.org/blog/?p=8720][Org and Anki | Irreal]]
    2. (!) [[https://yiufung.net/post/anki-org/][Power up Anki with Emacs, Org mode, anki-editor...]]
    3. (!) [[http://augmentingcognition.com/ltm.html][Augmenting Long-term Memory]]
    4. [[https://news.ycombinator.com/item?id=25226621][How to Memorize Faster with the Spaced Repetition Learning Technique | Hacker News]]
    5. [[https://github.com/abo-abo/pamparam][abo-abo/pamparam: Simple and fast flashcards for Emacs]]
    6. [[https://www.reddit.com/r/emacs/comments/gzz0a4/should_i_move_from_notion_to_orgmode/][Should I move from Notion to org-mode? : emacs]]
    7. [[https://jherrlin.github.io/posts/learn-awk/][Learn AWK with Emacs | jherrlin]]
    8. [[https://blog.jethro.dev/][Jethro Kuan]] (everything :-)
    9. [[https://github.com/louietan/org-drill][louietan/org-drill]]
    10. [[https://irreal.org/blog/?p=8318][Emacs Workout | Irreal]]
    11. [[https://github.com/l3kn/org-fc][l3kn/org-fc: Spaced Repetition System for Emacs org-mode]]
