content/posts/spaced-repetition-learning-with-emacs.md
+++
title = "Spaced repetition – Learning with Emacs and Anki"
author = ["Alex Qwxlea"]
date = 2021-01-23T12:19:00+02:00
lastmod = 2021-01-23T13:23:28+02:00
tags = ["emacs"]
draft = false
+++

Remembering is hard. Well, not for everybody, but for the average person, yes, it's hard. But, since leaving our caves, we have been busy creating tools. To remember things the best tools seems to be [Spaced repetition (Wikipedia)](https://en.wikipedia.org/wiki/Spaced%5Frepetition):

> Spaced repetition is an evidence-based learning technique that is usually performed with flashcards. Newly introduced and more difficult flashcards are shown more frequently, while older and less difficult flashcards are shown less frequently in order to exploit the psychological spacing effect. The use of spaced repetition has been proven to increase rate of learning.

The idea is to memorize 'hungul', the Korean alphabet. A popular tool seems to be [anki](https://ankiweb.net), open-source software that makes it easy to create and use 'decks' of cards. There are a whole bunch of decks for Korean, but I started out with [this one](https://ankiweb.net/shared/info/1831087318). What I especially like is the possibility to use anki both on my phone ([AnkiDroid](https://f-droid.org/en/packages/com.ichi2.anki/)) and one my computer.

After setting it up, I remembered [reading about org and anki](https://irreal.org/blog/?p=8720). So, with a bit of googling I now have a simple setup to create my own cards. For Emacs, the second link under **Further reading** is excellent, for Anki, the 3rd.

But first: let's memorize some more Korean characters, here's a small comic: ㅎㅂ ㄹㅆ ㄱㅎ ㄲㅎ (a man with a Hat, carrying a Bucket, sees a Ratelsnake, which hiSSes. the man with the Hat takes his Gun, and then the man with the Hat pulls the trigger to Kill the snake)


## Further reading {#further-reading}

1.  [Org and Anki | Irreal](https://irreal.org/blog/?p=8720)
2.  (!) [Power up Anki with Emacs, Org mode, anki-editor...](https://yiufung.net/post/anki-org/)
3.  (!) [Augmenting Long-term Memory](http://augmentingcognition.com/ltm.html)
4.  [How to Memorize Faster with the Spaced Repetition Learning Technique | Hacker News](https://news.ycombinator.com/item?id=25226621)
5.  [abo-abo/pamparam: Simple and fast flashcards for Emacs](https://github.com/abo-abo/pamparam)
6.  [Should I move from Notion to org-mode? : emacs](https://www.reddit.com/r/emacs/comments/gzz0a4/should%5Fi%5Fmove%5Ffrom%5Fnotion%5Fto%5Forgmode/)
7.  [Learn AWK with Emacs | jherrlin](https://jherrlin.github.io/posts/learn-awk/)
8.  [Jethro Kuan](https://blog.jethro.dev/) (everything :-)
9.  [louietan/org-drill](https://github.com/louietan/org-drill)
10. [Emacs Workout | Irreal](https://irreal.org/blog/?p=8318)
11. [l3kn/org-fc: Spaced Repetition System for Emacs org-mode](https://github.com/l3kn/org-fc)
